app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums`
---
  def index
    @albums = Album.all

INSERT INTO "albums" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Sep 2013 06:41:54 UTC +00:00], ["title", "test"], ["updated_at", Wed, 18 Sep 2013 06:41:54 UTC +00:00]]
---
  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 2 LIMIT 1
---
  def update
    @album = Album.find(params[:id])

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
DELETE FROM `albums` WHERE `albums`.`id` = 1
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy