app/controllers/pictures_controller.rb

  def index
    @pictures = @album.pictures
    render :json => @pictures.collect { |p| p.to_jq_upload }.to_json
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`album_id` = 2

  def create
    @picture = @album.pictures.new
    @picture.avatar = params[:picture][:path].shift
  	@picture.title = params[:title].shift
    if @picture.save
---
INSERT INTO `pictures` (`album_id`, `avatar`, `avatar_name`, `avatar_uid`, `cover_photo`, `created_at`, `name`, `path`, `title`, `updated_at`) VALUES (5, 'Screenshot_from_2013-08-13_17_04_46.png', NULL, NULL, NULL, '2013-09-18 11:10:48', NULL, NULL, NULL, '2013-09-18 11:10:48')